### Importando um Dataset com Pandas

**Manipulação de Arquivos - Parte 2**

In [33]:
# importando o pandas
import pandas as pd

In [34]:
# versão do pandas
pd.__version__

'2.2.2'

In [35]:
# armazenando o arquivo CSV em uma var
arquivo = 'arquivos/salarios.csv'

In [36]:
# carregando e lendo o arquivo CSV e armazenando em um df
df = pd.read_csv(arquivo)

In [37]:
# lendo as 5 primeiras linhas (head)
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"GARCIA, CHRISTOPHER A",CLERK - BD OF ELECTIONS,BOARD OF ELECTION COMMISSIONERS,F,SALARY,NaN,34176.0,NaN
1,"ASHFORD, MARQUISHA D",INQUIRY AIDE III,OFFICE OF PUBLIC SAFETY ADMINISTRATION,F,SALARY,NaN,46056.0,NaN
2,"MATHIS, DESIREE",PERSONNEL ASSISTANT,OFFICE OF PUBLIC SAFETY ADMINISTRATION,F,SALARY,NaN,70608.0,NaN
3,"GRAY, DERYL R",ALDERMANIC AIDE,CITY COUNCIL,P,HOURLY,20.0,NaN,25.0
4,"MACK, QIANA S",LEAVE OF ABSENCE ADMIN,OFFICE OF PUBLIC SAFETY ADMINISTRATION,F,SALARY,NaN,66684.0,NaN

In [38]:
# exibe informacoes sobre o df, como os tipos de dados e os valores ausentes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32401 entries, 0 to 32400
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32401 non-null  object
 1   Job Titles         32401 non-null  object
 2   Department         32401 non-null  object
 3   Full or Part-Time  32400 non-null  object
 4   Salary or Hourly   32401 non-null  object
 5   Typical Hours      7507 non-null   float64
 6   Annual Salary      24894 non-null  float64
 7   Hourly Rate        7507 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

In [39]:
# retorna um df booleano indicando valores nulos + sum() para somar os valores ausentes por coluna
df.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        1
Salary or Hourly         0
Typical Hours        24894
Annual Salary         7507
Hourly Rate          24894
dtype: int64

In [40]:
# substitui valores nulos com um valor específico, nesse caso com o valor 0
# df.fillna(0)

In [41]:
# remove linhas ou colunas que tenham valores nulos (passamos o parametro, se for linha axis=0, se for coluna axix=1)
# df.dropna()

In [45]:
# renomeia colunas ou indices do df
df.rename(columns={'Hourly Rate': 'H.R.'}, inplace=True)
df.head(2)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,H.R.
0,"GARCIA, CHRISTOPHER A",CLERK - BD OF ELECTIONS,BOARD OF ELECTION COMMISSIONERS,F,SALARY,NaN,34176.0,NaN
1,"ASHFORD, MARQUISHA D",INQUIRY AIDE III,OFFICE OF PUBLIC SAFETY ADMINISTRATION,F,SALARY,NaN,46056.0,NaN

In [50]:
# agrupa dados por uma ou mais colunas pra realizar calculos agregados, nesse caso quero saber a media de cada job
df.groupby('Job Titles')['Annual Salary'].mean()

Job Titles
A/SUPRV REDISTRICTING                 66528.000000
ACCESSIBILITY INSPECTOR               82644.000000
ACCIDENT ADJUSTER                     74407.200000
ACCOUNTANT                            95505.230769
ACCOUNTANT I                          87762.000000
                                         ...
WEB DEVELOPER/ADMINISTRATOR (OIG)    100476.000000
WINDOW WASHER                                  NaN
WORKERS COMPENSATION CLAIMS COORD     79212.000000
YOUTH SERVICES COORD                  96872.000000
ZONING INVESTIGATOR                  113956.000000
Name: Annual Salary, Length: 1149, dtype: float64

In [51]:
# estatisticas resumidas, como: media, mediana, desvio padrao, min. e max, etc
df.describe()

       Typical Hours  Annual Salary         H.R.
count    7507.000000   24894.000000  7507.000000
mean       36.764353  104692.550995    43.958086
std         7.739911   25768.993058    13.882757
min        10.000000   31992.000000     4.000000
25%        40.000000   88746.000000    37.780000
50%        40.000000  102870.000000    47.230000
75%        40.000000  118128.000000    52.000000
max        40.000000  297084.000000   120.000000

In [54]:
# calcula a media de uma coluna ou de todas as colunas numericas
df['Annual Salary'].mean()

104692.55099542058

In [55]:
# retorna a mediana dos valores
df['Annual Salary'].median()

102870.0

In [59]:
# calcula a correlação entre as colunas numericas
# df.corr()

In [62]:
# conta a frequencia de valores unicos em uma coluna
df['Annual Salary'].value_counts()

Annual Salary
102870.0    2554
114264.0     977
117564.0     825
88746.0      776
106482.0     757
            ...
81324.0        1
95484.0        1
89160.0        1
197604.0       1
96252.0        1
Name: count, Length: 860, dtype: int64